/*

// 수박수박수
function solution(n){
  const answer = "";
  return '수박'.repeat(n).substring(0,n);
}
console.log(solution(3));



function solution(n) {
  var answer = '';
  // const arr = ["수","박"];
  if(n%2 == 0){
      // for(let i = 0; i < n; i++){
      //   "수박".repeat(n)
      // }
      answer += "박"
  } else {
    // for(let i = 0; i < n; i++){
    //   "수박".repeat(n)
    // }
    answer += "수"
  }
  return answer;
}
solution(6);




function solution(n) {
  var answer = '수박';
  if(n%2 == 0){
    console.log(answer.repeat(n).substring(0,n));
  } else {
    console.log(answer.repeat(n).substring(0,n));
  }
  return answer;
}
solution(2);

*/

/*--------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------*/

/*

문제 설명
정수 n을 입력받아 n의 약수를 모두 더한 값을 리턴하는 함수, solution을 완성해주세요.

제한 사항
n은 0 이상 3000이하인 정수입니다.


입출력 예
n	return
12	28
5	6


입출력 예 설명

입출력 예 #1
12의 약수는 1, 2, 3, 4, 6, 12입니다. 이를 모두 더하면 28입니다.

입출력 예 #2
5의 약수는 1, 5입니다. 이를 모두 더하면 6입니다.

*/





















/*--------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------*/






























/*--------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------*/