/*
  41번 소수 판별
  숫자가 주어지면 소수인지 아닌지 판별하는 프로그램을 작성해주세요.
  소수이면 YES, 소수가 아니면 NO로 출력해주세요.
  (소수: 1과 자기 자신만으로 나누어 떨어지는 1보다 큰 양의 정수)
*/










/*
  42번 2020년
  2020년 1월 1일은 수요일입니다. 2020년 a월 b일은 무슨 요일일까요?
  두 수 a,b를 입력받아 2020년 a월 b일이 무슨요일인지 리턴하는 함수 solution을 완성하시오.
  요일의 이름은 일요일부터 토요일까지 각각 SUN, MON, TUE, WED, THU, FRI, SAT 입니다.
  
  제한조건
  2020년은 윤년입니다.
  2020년 a월 b일은 실제로 있는 날입니다.
  (13월 26일이나 2월 45일 같은 날자는 주어지지 않습니다.)
*/










/*
  43번 10진수를 2진수로
  사용자에게 숫자를 입력받고 이를 2진수로 바꾸고 그 값을 출력해주세요.
*/

const solution = (a) => {
  const 진수변환 = a.toString(2);
  console.log(진수변환)
}

solution(1);
solution(2);
solution(3);
solution(4);
solution(5);
solution(6);
solution(7);
solution(8);
solution(9);
solution(10);









/*
  44번 각 자리수의 합
  사용자가 입력한 양의 정수의 각 자리수의 합을 구하는 프로그램을 만드시오

  예를들어
  18234 = 1+8+2+3+4이고 정답은 18입니다.
  3849 = 3+8+4+9이고 정답은 24입니다.

  입력: 18234 / 3849
  출력: 18 / 24
*/












/*
  45번 getTime()함수 사용하기
  Date객체의 메소드 중 하나인 getTime()은 1970년 1월 1일 0시 0분 0초 이후로부터 지금까지 흐른 시간을
  천분의 1초 단위로 변환합니다.
  
  이를 이용하여 현재연도(2022)를 출력해보세요.
*/













/*
  46번 각 자리수의 합 2
  1부터 20까지의 모든 숫자를 일렬로 놓고 모든 자릿수의 총 합을 구하세요.
  
  예를 들어 10부터 15까지의 모든 숫자를 일렬로 놓으면 101112131415이고
  각 자리의 숫자를 더하면 21입니다. (1+0+1+1+1+2+1+3+1+4+1+5=21)
*/














/*
  47번
*/












/*
  48번
*/














/*
  49번
*/


















/*
  50번
*/

















